app/controllers/favoritos_controller.rb

SELECT "favoritos".* FROM "favoritos"
---
  def index
    @favoritos = Favorito.all

INSERT INTO "favoritos" ("nomeLocal", "posicionamento_id", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nomeLocal", "IFF"], ["posicionamento_id", 1], ["usuario_id", 1], ["created_at", "2016-05-15 22:04:16.704479"], ["updated_at", "2016-05-15 22:04:16.704479"]]
---
  def create
    @favorito = Favorito.new(favorito_params)

    respond_to do |format|
      if @favorito.save

UPDATE "favoritos" SET "nomeLocal" = ?, "posicionamento_id" = ?, "usuario_id" = ?, "updated_at" = ? WHERE "favoritos"."id" = ?  [["nomeLocal", "IFF"], ["posicionamento_id", 1], ["usuario_id", 1], ["updated_at", "2016-05-15 22:04:16.555610"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @favorito.update(favorito_params)

DELETE FROM "favoritos" WHERE "favoritos"."id" = ?  [["id", 1]]
---
  def destroy
    @favorito.destroy

SELECT  "favoritos".* FROM "favoritos" WHERE "favoritos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_favorito
      @favorito = Favorito.find(params[:id])