app/controllers/posicionamentos_controller.rb

SELECT "posicionamentos".* FROM "posicionamentos"
---
  def index
    @posicionamentos = Posicionamento.all

INSERT INTO "posicionamentos" ("posicao", "data", "horario", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["posicao", "101010"], ["data", "10/10/2016"], ["horario", "10:10"], ["usuario_id", 1], ["created_at", "2016-05-14 22:29:01.228014"], ["updated_at", "2016-05-14 22:29:01.228014"]]
---
  def create
    @posicionamento = Posicionamento.new(posicionamento_params)

    respond_to do |format|
      if @posicionamento.save

UPDATE "posicionamentos" SET "posicao" = ?, "data" = ?, "horario" = ?, "usuario_id" = ?, "updated_at" = ? WHERE "posicionamentos"."id" = ?  [["posicao", "101010"], ["data", "10/10/2016"], ["horario", "10:10"], ["usuario_id", 1], ["updated_at", "2016-05-14 22:29:01.376952"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @posicionamento.update(posicionamento_params)

DELETE FROM "posicionamentos" WHERE "posicionamentos"."id" = ?  [["id", 1]]
---
  def destroy
    @posicionamento.destroy

SELECT  "posicionamentos".* FROM "posicionamentos" WHERE "posicionamentos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_posicionamento
      @posicionamento = Posicionamento.find(params[:id])