app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("login", "senha", "nome", "email", "numero", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE "usuarios" SET "login" = ?, "senha" = ?, "nome" = ?, "email" = ?, "numero" = ?, "status" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["login", "Ricardo"], ["senha", "Ricardo"], ["nome", "Ricardo"], ["email", "Ricardo"], ["numero", "998989898"], ["status", "t"], ["updated_at", "2016-05-15 21:11:21.362402"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]
---
  def destroy
    @usuario.destroy